const CATEGORIES = [
	{
		title: ' Искусство и дизайн ',
		items: [
			{
				title: 'Архитектура',
				link: '/',
			},
			{
				title: 'Граффити',
				link: '/',
			},
			{
				title: 'Дизайн',
				link: '/',
			},
			{
				title: 'Живопись',
				link: '/',
			},
			{
				title: 'Рисование (графика)',
				link: '/',
			},
			{
				title: 'Скульптура',
				link: '/',
			},
			{
				title: 'Фотография',
				link: '/',
			},
		],
	},
	{
		title: ' ДПИ и ремесла ',
		items: [
			{
				title: 'Бумагопластика, оригами',
				link: '/',
			},
			{
				title: 'Керамика и гончарное дело',
				link: '/',
			},
			{
				title: 'Кожевенное дело',
				link: '/',
			},
			{
				title: 'Кулинария',
				link: '/',
			},
			{
				title: 'Лепка',
				link: '/',
			},
			{
				title: 'Мозаика, витраж',
				link: '/',
			},
			{
				title: 'Обработка дерева',
				link: '/',
			},
			{
				title: 'Плетение',
				link: '/',
			},
			{
				title: 'Резьба по дереву, камню, кости',
				link: '/',
			},
			{
				title: 'Роспись',
				link: '/',
			},
			{
				title: 'Рукоделие',
				link: '/',
			},
			{
				title: 'Флористика',
				link: '/',
			},
		],
	},
	{
		title: ' Техническое конструирование ',
		items: [
			{
				title: 'Авиамодельный спорт',
				link: '/',
			},
			{
				title: 'Автодело',
				link: '/',
			},
			{
				title: 'Начальное техническое моделирование',
				link: '/',
			},
			{
				title: 'Прототипирование',
				link: '/',
			},
			{
				title: 'Радиотехника',
				link: '/',
			},
			{
				title: 'Ракетно-космическое моделирование',
				link: '/',
			},
			{
				title: 'Робототехника',
				link: '/',
			},
			{
				title: 'Судомодельный спорт',
				link: '/',
			},
		],
	},
	{
		title: ' Словесность ',
		items: [
			{
				title: 'Журналистика',
				link: '/',
			},
			{
				title: 'Каллиграфия',
				link: '/',
			},
			{
				title: 'Литература, поэзия',
				link: '/',
			},
			{
				title: 'Русский язык',
				link: '/',
			},
			{
				title: 'Скорочтение',
				link: '/',
			},
		],
	},
	{
		title: ' Иностранные языки ',
		items: [
			{
				title: 'Английский язык',
				link: '/',
			},
			{
				title: 'Китайский язык',
				link: '/',
			},
			{
				title: 'Немецкий язык',
				link: '/',
			},
			{
				title: 'Французский язык',
				link: '/',
			},
		],
	},
	{
		title: ' Развитие интеллекта ',
		items: [
			{
				title: 'Интеллектуальные игры',
				link: '/',
			},
			{
				title: 'Математика',
				link: '/',
			},
			{
				title: 'Обществознание',
				link: '/',
			},
			{
				title: 'Ораторское мастерство',
				link: '/',
			},
			{
				title: 'Основы права',
				link: '/',
			},
			{
				title: 'Психология',
				link: '/',
			},
			{
				title: 'Шахматы',
				link: '/',
			},
			{
				title: 'Экономика и бизнес',
				link: '/',
			},
		],
	},
	{
		title: ' Информационные технологии ',
		items: [
			{
				title: 'Информатика',
				link: '/',
			},
			{
				title: 'Компьютерная графика',
				link: '/',
			},
			{
				title: 'Основы компьютерной грамотности',
				link: '/',
			},
			{
				title: 'Программирование',
				link: '/',
			},
			{
				title: 'Разработка сайтов',
				link: '/',
			},
		],
	},
	{
		title: ' История и традиции ',
		items: [
			{
				title: 'История',
				link: '/',
			},
			{
				title: 'Краеведение',
				link: '/',
			},
			{
				title: 'Традиционная культура',
				link: '/',
			},
		],
	},
	{
		title: ' Педагогика ',
		items: [
			{
				title: 'Вожатское мастерство',
				link: '/',
			},
			{
				title: 'Группы продленного дня',
				link: '/',
			},
			{
				title: 'Дети особой заботы',
				link: '/',
			},
			{
				title: 'Духовное воспитание',
				link: '/',
			},
			{
				title: 'Музыка (общее развитие)',
				link: '/',
			},
			{
				title: 'Патриотическое воспитание',
				link: '/',
			},
			{
				title: 'Подготовка к ЕГЭ и ОГЭ',
				link: '/',
			},
			{
				title: 'Подготовка к школе',
				link: '/',
			},
			{
				title: 'Предпрофессиональная подготовка',
				link: '/',
			},
			{
				title: 'Профориентация',
				link: '/',
			},
			{
				title: 'Развитие речи, логопедия',
				link: '/',
			},
			{
				title: 'Раннее развитие малышей',
				link: '/',
			},
		],
	},
	{
		title: ' Музыка и звук ',
		items: [
			{
				title: 'Гитара',
				link: '/',
			},
			{
				title: 'Диджеинг',
				link: '/',
			},
			{
				title: 'Духовые инструменты',
				link: '/',
			},
			{
				title: 'Народные инструменты',
				link: '/',
			},
			{
				title: 'Скрипка',
				link: '/',
			},
			{
				title: 'Струнные инструменты',
				link: '/',
			},
			{
				title: 'Ударные инструменты',
				link: '/',
			},
			{
				title: 'Фортепиано (пианино)',
				link: '/',
			},
		],
	},
	{
		title: ' Пение ',
		items: [
			{
				title: 'Авторская песня',
				link: '/',
			},
			{
				title: 'Академический вокал',
				link: '/',
			},
			{
				title: 'Народная песня',
				link: '/',
			},
			{
				title: 'Хоровое пение',
				link: '/',
			},
			{
				title: 'Эстрадный вокал',
				link: '/',
			},
		],
	},
	{
		title: ' Хореография (танцы) ',
		items: [
			{
				title: 'Балет',
				link: '/',
			},
			{
				title: 'Бальные танцы',
				link: '/',
			},
			{
				title: 'Классические танцы',
				link: '/',
			},
			{
				title: 'Ритмика',
				link: '/',
			},
			{
				title: 'Современные танцы',
				link: '/',
			},
			{
				title: 'Спортивные танцы',
				link: '/',
			},
			{
				title: 'Танцы народов мира',
				link: '/',
			},
			{
				title: 'Эстрадные танцы',
				link: '/',
			},
		],
	},
	{
		title: ' Зрелищные искусства ',
		items: [
			{
				title: 'Актерское мастерство (театр)',
				link: '/',
			},
			{
				title: 'Кино- и видеосъемка',
				link: '/',
			},
			{
				title: 'Кукольное искусство эстрады',
				link: '/',
			},
			{
				title: 'Мультипликация',
				link: '/',
			},
			{
				title: 'Цирковое искусство',
				link: '/',
			},
		],
	},
	{
		title: ' Мода и стиль ',
		items: [
			{
				title: 'Кройка и шитье',
				link: '/',
			},
			{
				title: 'Создание имиджа',
				link: '/',
			},
			{
				title: 'Школы моделей',
				link: '/',
			},
			{
				title: 'Этикет',
				link: '/',
			},
		],
	},
	{
		title: ' Познавательные развлечения ',
		items: [
			{
				title: 'Выставки',
				link: '/',
			},
			{
				title: 'Игротеки',
				link: '/',
			},
			{
				title: 'Квесты',
				link: '/',
			},
			{
				title: 'Летние лагеря',
				link: '/',
			},
			{
				title: 'Новый год',
				link: '/',
			},
			{
				title: 'Репертуарные спектакли',
				link: '/',
			},
			{
				title: 'Экскурсии',
				link: '/',
			},
		],
	},
	{
		title: ' Туризм ',
		items: [
			{
				title: 'Безопасность жизнедеятельности',
				link: '/',
			},
			{
				title: 'Скалолазание, альпинизм',
				link: '/',
			},
			{
				title: 'Спортивное ориентирование',
				link: '/',
			},
			{
				title: 'Спортивный туризм',
				link: '/',
			},
		],
	},
	{
		title: ' Естественные науки ',
		items: [
			{
				title: 'Астрономия',
				link: '/',
			},
			{
				title: 'Биология',
				link: '/',
			},
			{
				title: 'География',
				link: '/',
			},
			{
				title: 'Геология',
				link: '/',
			},
			{
				title: 'Медицина',
				link: '/',
			},
			{
				title: 'Природоведение',
				link: '/',
			},
			{
				title: 'Физика',
				link: '/',
			},
			{
				title: 'Химия',
				link: '/',
			},
			{
				title: 'Экология',
				link: '/',
			},
		],
	},
	{
		title: ' Люди и животные ',
		items: [
			{
				title: 'Зоопарки',
				link: '/',
			},
			{
				title: 'Конный спорт',
				link: '/',
			},
			{
				title: 'Практическая зоология',
				link: '/',
			},
		],
	},
	{
		title: ' Эстетические виды спорта ',
		items: [
			{
				title: 'Акробатика',
				link: '/',
			},
			{
				title: 'Прыжки на батуте',
				link: '/',
			},
			{
				title: 'Спортивная аэробика',
				link: '/',
			},
			{
				title: 'Спортивная гимнастика',
				link: '/',
			},
			{
				title: 'Фигурное катание',
				link: '/',
			},
			{
				title: 'Художественная гимнастика',
				link: '/',
			},
			{
				title: 'Черлидинг, чир-спорт',
				link: '/',
			},
		],
	},
	{
		title: ' Технические виды спорта ',
		items: [
			{
				title: 'Автоспорт',
				link: '/',
			},
			{
				title: 'Велоспорт',
				link: '/',
			},
			{
				title: 'Картинг',
				link: '/',
			},
			{
				title: 'Лыжные гонки',
				link: '/',
			},
			{
				title: 'Роллер-спорт',
				link: '/',
			},
		],
	},
	{
		title: ' Единоборства ',
		items: [
			{
				title: 'Айкидо',
				link: '/',
			},
			{
				title: 'Бокс',
				link: '/',
			},
			{
				title: 'Греко-римская борьба',
				link: '/',
			},
			{
				title: 'Джиу-джитсу',
				link: '/',
			},
			{
				title: 'Дзюдо',
				link: '/',
			},
			{
				title: 'Капоэйра',
				link: '/',
			},
			{
				title: 'Карате',
				link: '/',
			},
			{
				title: 'Кикбоксинг',
				link: '/',
			},
			{
				title: 'Кунг-фу (ушу)',
				link: '/',
			},
			{
				title: 'Рукопашный бой',
				link: '/',
			},
			{
				title: 'Самбо',
				link: '/',
			},
			{
				title: 'Тайский бокс',
				link: '/',
			},
			{
				title: 'Тхэквондо',
				link: '/',
			},
		],
	},
	{
		title: ' Командно-игровой спорт ',
		items: [
			{
				title: 'Баскетбол',
				link: '/',
			},
			{
				title: 'Волейбол',
				link: '/',
			},
			{
				title: 'Флорбол',
				link: '/',
			},
			{
				title: 'Футбол',
				link: '/',
			},
			{
				title: 'Хоккей',
				link: '/',
			},
		],
	},
	{
		title: ' Индивидуально-игровой спорт ',
		items: [
			{
				title: 'Бильярд',
				link: '/',
			},
			{
				title: 'Настольный теннис',
				link: '/',
			},
			{
				title: 'Теннис',
				link: '/',
			},
			{
				title: 'Фехтование',
				link: '/',
			},
		],
	},
	{
		title: ' Водные виды спорта ',
		items: [
			{
				title: 'Аквааэробика',
				link: '/',
			},
			{
				title: 'Гребля',
				link: '/',
			},
			{
				title: 'Парусный спорт',
				link: '/',
			},
			{
				title: 'Плавание',
				link: '/',
			},
		],
	},
	{
		title: ' Легкая атлетика и гимнастика ',
		items: [
			{
				title: 'Бег',
				link: '/',
			},
			{
				title: 'Фитнес',
				link: '/',
			},
		],
	},
	{
		title: ' Физкультура ',
		items: [
			{
				title: 'Адаптивная физкультура',
				link: '/',
			},
			{
				title: 'Йога',
				link: '/',
			},
			{
				title: 'Общая физическая подготовка',
				link: '/',
			},
			{
				title: 'Тренажерные залы',
				link: '/',
			},
		],
	},
];

export default CATEGORIES;
